In [2]:
import mysql.connector # Importing database
database = mysql.connector.connect(
    host ='localhost',
    user = 'root',
    password = "",
    database = 'class4pm'
)
db = database.cursor()

In [5]:
sql = "INSERT INTO student (name, roll, physics, chemistry, math, english, nepali, total, per) VALUES ('Shyam', 35, 69, 49, 86, 47, 67, 89, 78 )"
db.execute(sql)
database.commit()

In [6]:
db.execute("SELECT * FROM student")

result = db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 1, 78, 89, 95, 69, 66, 305, 89.0)
(2, 'Shyam', 35, 69, 49, 86, 47, 67, 89, 78.0)
(3, 'Shyam', 35, 69, 49, 86, 47, 67, 89, 78.0)